## Анализ набора данных с использованием `pandas` (2)

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('Employee.csv')

In [2]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [2]:
df.columns

Index(['Education', 'JoiningYear', 'City', 'PaymentTier', 'Age', 'Gender',
       'EverBenched', 'ExperienceInCurrentDomain', 'LeaveOrNot'],
      dtype='object')

In [3]:
df.groupby('EverBenched')['LeaveOrNot'].mean()*100

EverBenched
No     33.125749
Yes    45.397490
Name: LeaveOrNot, dtype: float64

Постройте сводную таблицу, показывающую средний возраст сотрудников в каждом городе.

In [8]:
pd.pivot_table(df, values='Age', index='City', aggfunc='mean')

                 Age
City
Bangalore  29.594255
New Delhi  29.121003
Pune       29.288644

In [9]:
df.pivot_table( values='Age', index='City', aggfunc='mean').round(2)

             Age
City
Bangalore  29.59
New Delhi  29.12
Pune       29.29

In [10]:
df.groupby('City')['Age'].mean()

City
Bangalore    29.594255
New Delhi    29.121003
Pune         29.288644
Name: Age, dtype: float64

Рассчитайте количество сотрудников по каждому уровню образования и их средний возраст.

In [11]:
df.pivot_table(values='Age', index='Education', aggfunc=['count','mean'])

          count       mean
            Age        Age
Education
Bachelors  3601  29.422938
Masters     873  29.290951
PHD         179  29.296089

In [13]:
df.groupby('Education').agg( Employees=('Education', 'count'), Age=('Age', 'mean'))

           Employees        Age
Education
Bachelors       3601  29.422938
Masters          873  29.290951
PHD              179  29.296089

In [14]:
df.groupby('Education')['Age'].agg([('Количество', 'count'), ('Средний возраст', 'mean')]).round(2)

           Количество  Средний возраст
Education
Bachelors        3601            29.42
Masters           873            29.29
PHD               179            29.30

Создайте сводную таблицу, показывающую количество мужчин и женщин в каждом уровне оплаты (Payment Tier).

In [15]:
df.pivot_table(values='Age', index=['PaymentTier','Gender'], aggfunc=['count'])

                   count
                     Age
PaymentTier Gender
1           Female   131
            Male     112
2           Female   605
            Male     313
3           Female  1139
            Male    2353

In [16]:
df.pivot_table(index='PaymentTier', columns='Gender', values='Age', aggfunc='count')

Gender       Female  Male
PaymentTier
1               131   112
2               605   313
3              1139  2353

Составьте сводную таблицу, отражающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от того, были ли они когда-либо исключены из проектов на месяц или более.

In [17]:
stats = df.groupby('EverBenched')['LeaveOrNot'].agg([ ('Всего', 'count'), ('Уволились', 'sum')])
stats['Остались'] = stats['Всего'] - stats['Уволились']

stats['Процент уволившихся'] = (stats['Уволились'] / stats['Всего'] * 100).round(1)
stats['Процент оставшихся'] = (stats['Остались'] / stats['Всего'] * 100).round(1)
stats.drop(columns=['Всего', 'Уволились', 'Остались'], inplace=True)
stats

             Процент уволившихся  Процент оставшихся
EverBenched
No                          33.1                66.9
Yes                         45.4                54.6

In [18]:
piv_table = df.pivot_table(index='EverBenched', values='LeaveOrNot', aggfunc='mean')


piv_table['Percent_Left'] = piv_table['LeaveOrNot'] * 100
piv_table = piv_table.drop(columns='LeaveOrNot')
piv_table

             Percent_Left
EverBenched
No              33.125749
Yes             45.397490

Постройте сводную таблицу, отображающую медианный опыт работы в текущей области в зависимости от уровня образования и пола сотрудников.

In [19]:
df.groupby([ 'Gender','Education']).agg(Experience=('ExperienceInCurrentDomain', 'median'))

                  Experience
Gender Education
Female Bachelors         3.0
       Masters           2.0
       PHD               3.0
Male   Bachelors         3.0
       Masters           3.0
       PHD               3.0

In [20]:
df.pivot_table(index='Gender', columns='Education', values='ExperienceInCurrentDomain', aggfunc='mean')

Education  Bachelors   Masters       PHD
Gender
Female      2.904530  2.846361  2.797101
Male        2.914589  2.912351  2.981818

In [21]:
df.pivot_table(index='Education', columns='Gender', values='ExperienceInCurrentDomain', aggfunc='median')

Gender     Female  Male
Education
Bachelors     3.0   3.0
Masters       2.0   3.0
PHD           3.0   3.0

Рассчитайте количество сотрудников по каждому году присоединения к компании и их средний возраст.

In [23]:
df.groupby([ 'JoiningYear']).agg( Employees=('Age', 'count'), Age=('Age', 'mean'))

             Employees        Age
JoiningYear
2012               504  29.603175
2013               669  29.008969
2014               699  29.290415
2015               781  29.476312
2016               525  29.552381
2017              1108  29.416968
2018               367  29.525886

In [24]:
df.groupby('JoiningYear').agg(Количество=('Age', 'count'), возраст=('Age', 'mean'))

             Количество    возраст
JoiningYear
2012                504  29.603175
2013                669  29.008969
2014                699  29.290415
2015                781  29.476312
2016                525  29.552381
2017               1108  29.416968
2018                367  29.525886

In [25]:
df.pivot_table( values='Age', index='JoiningYear', aggfunc=['count','mean'])

            count       mean
              Age        Age
JoiningYear
2012          504  29.603175
2013          669  29.008969
2014          699  29.290415
2015          781  29.476312
2016          525  29.552381
2017         1108  29.416968
2018          367  29.525886

Создайте сводную таблицу, показывающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня образования и города, в котором они работают.

In [27]:
df.pivot_table(index='Education', columns='City', values='LeaveOrNot', aggfunc= lambda x: x.mean()*100)

City       Bangalore  New Delhi       Pune
Education
Bachelors  24.025341  18.063315  53.260870
Masters    70.161290  47.001934  41.379310
PHD        28.846154  25.242718  16.666667

Составьте сводную таблицу, отображающую средний возраст сотрудников, которые были когда-либо исключены из проектов, и тех, кто не был, в зависимости от уровня оплаты.

In [28]:
df.pivot_table(columns='EverBenched', values='Age', index=['PaymentTier'], aggfunc='mean')

EverBenched         No        Yes
PaymentTier
1            29.644444  28.944444
2            29.204848  28.989247
3            29.460160  29.217984

In [29]:
df.groupby(['EverBenched', 'PaymentTier']).agg(Age=('Age', 'mean'))

                               Age
EverBenched PaymentTier
No          1            29.644444
            2            29.204848
            3            29.460160
Yes         1            28.944444
            2            28.989247
            3            29.217984

In [31]:
df.pivot_table(values='Age', index='PaymentTier', columns='EverBenched')

EverBenched         No        Yes
PaymentTier
1            29.644444  28.944444
2            29.204848  28.989247
3            29.460160  29.217984

Постройте сводную таблицу, показывающую средний возраст сотрудников, которые покинули компанию в следующие два года, в зависимости от города и опыта работы в текущей области.

In [32]:
Leavernoe = df[df['LeaveOrNot'] != 0]
Leavernoe.pivot_table(dropna= True, index='City', columns=['ExperienceInCurrentDomain'], values='Age', aggfunc='mean')

ExperienceInCurrentDomain,0,1,2,3,4,5,6,7
City,,,,,,,,
Bangalore,30.822222,30.975309,29.413793,28.669492,28.115789,28.905660,38.5,39.0
New Delhi,30.000000,30.090909,29.724771,27.552239,27.472973,27.984375,NaN,NaN
Pune,31.833333,31.283784,28.406897,28.359649,27.898438,28.728814,NaN,NaN

In [33]:
df[df['LeaveOrNot'] == 1].pivot_table(values='Age', index='City', columns='ExperienceInCurrentDomain', aggfunc='mean', fill_value='x').round(1)

/var/folders/24/z61d72zx27z5ml8twybhwmm40000gn/T/ipykernel_92814/1488749123.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df[df['LeaveOrNot'] == 1].pivot_table(values='Age', index='City', columns='ExperienceInCurrentDomain', aggfunc='mean', fill_value='x').round(1)

ExperienceInCurrentDomain     0     1     2     3     4     5     6     7
City
Bangalore                  30.8  31.0  29.4  28.7  28.1  28.9  38.5  39.0
New Delhi                  30.0  30.1  29.7  27.6  27.5  28.0     x     x
Pune                       31.8  31.3  28.4  28.4  27.9  28.7     x     x

In [34]:
df[df['LeaveOrNot'] == 1].pivot_table(columns='City', values='Age', index='ExperienceInCurrentDomain', aggfunc='mean')

City                       Bangalore  New Delhi       Pune
ExperienceInCurrentDomain
0                          30.822222  30.000000  31.833333
1                          30.975309  30.090909  31.283784
2                          29.413793  29.724771  28.406897
3                          28.669492  27.552239  28.359649
4                          28.115789  27.472973  27.898438
5                          28.905660  27.984375  28.728814
6                          38.500000        NaN        NaN
7                          39.000000        NaN        NaN

In [35]:
df[df['LeaveOrNot'] == 1].pivot_table(index='City', columns='ExperienceInCurrentDomain', values='Age', aggfunc='mean')

ExperienceInCurrentDomain,0,1,2,3,4,5,6,7
City,,,,,,,,
Bangalore,30.822222,30.975309,29.413793,28.669492,28.115789,28.905660,38.5,39.0
New Delhi,30.000000,30.090909,29.724771,27.552239,27.472973,27.984375,NaN,NaN
Pune,31.833333,31.283784,28.406897,28.359649,27.898438,28.728814,NaN,NaN

Создайте сводную таблицу, отображающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня оплаты и того, были ли они когда-либо исключены из проектов на месяц или более.

In [36]:
new = df.pivot_table(columns=['PaymentTier','EverBenched'], values='Age', index='LeaveOrNot', aggfunc='count')
for col in new.columns:
    new[col] = new[col]/new[col].sum()*100
new.transpose()

LeaveOrNot                       0          1
PaymentTier EverBenched
1           No           64.444444  35.555556
            Yes          50.000000  50.000000
2           No           42.424242  57.575758
            Yes          19.354839  80.645161
3           No           73.504000  26.496000
            Yes          63.760218  36.239782

In [37]:
df.pivot_table(index='EverBenched', columns='PaymentTier', values='LeaveOrNot', aggfunc='mean') * 100

PaymentTier          1          2          3
EverBenched
No           35.555556  57.575758  26.496000
Yes          50.000000  80.645161  36.239782

In [38]:
pivot_count = df.pivot_table(values='Age', index='PaymentTier', columns='EverBenched',aggfunc='count')
pivot_leave = df[df['LeaveOrNot'] == 1].pivot_table(values='Age', index='PaymentTier', columns='EverBenched', aggfunc='count')
pivot_percentage = (pivot_leave / pivot_count * 100).round(1)
pivot_percentage

EverBenched    No   Yes
PaymentTier
1            35.6  50.0
2            57.6  80.6
3            26.5  36.2

In [39]:
df.pivot_table(index='EverBenched', columns=['PaymentTier'], values='LeaveOrNot', aggfunc= lambda x: x.mean()*100).round(1)

PaymentTier     1     2     3
EverBenched
No           35.6  57.6  26.5
Yes          50.0  80.6  36.2